espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/uhci_struct.h
/** Type of hung_conf register
 *  UHCI Hung Configuration Register0
 */
typedef union {
    struct {
        /** txfifo_timeout : R/W; bitpos: [7:0]; default: 16;
         *  Stores the timeout value. DMA generates UHCI_TX_HUNG_INT for timeout when receiving
         *  data.
         */
        uint32_t txfifo_timeout:8;
        /** txfifo_timeout_shift : R/W; bitpos: [10:8]; default: 0;
         *  Configures the maximum counter value.
         */
        uint32_t txfifo_timeout_shift:3;
        /** txfifo_timeout_ena : R/W; bitpos: [11]; default: 1;
         *  Set this bit to enable TX FIFO timeout when receiving.
         */
        uint32_t txfifo_timeout_ena:1;
        /** rxfifo_timeout : R/W; bitpos: [19:12]; default: 16;
         *  Stores the timeout value. DMA generates UHCI_TX_HUNG_INT for timeout when reading
         *  RAM data.
         */
        uint32_t rxfifo_timeout:8;
        /** rxfifo_timeout_shift : R/W; bitpos: [22:20]; default: 0;
         *  Configures the maximum counter value.
         */
        uint32_t rxfifo_timeout_shift:3;
        /** rxfifo_timeout_ena : R/W; bitpos: [23]; default: 1;
         *  Set this bit to enable TX FIFO timeout when DMA sending data.
         */
        uint32_t rxfifo_timeout_ena:1;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} uhci_hung_conf_reg_t;

/** Type of ack_num register
 *  UHCI Ack Value Configuration Register0
 */
typedef union {
    struct {
        /** ack_num : R/W; bitpos: [2:0]; default: 0;
         *  Indicates the ACK number during software flow control.
         */
        uint32_t ack_num:3;
        /** ack_num_load : WT; bitpos: [3]; default: 0;
         *  Set this bit to load the ACK value of UHCI_ACK_NUM.
         */
        uint32_t ack_num_load:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} uhci_ack_num_reg_t;

/** Type of quick_sent register
 *  UCHI Quick send Register
 */
typedef union {
    struct {
        /** single_send_num : R/W; bitpos: [2:0]; default: 0;
         *  Configures single_send mode.
         */
        uint32_t single_send_num:3;
        /** single_send_en : WT; bitpos: [3]; default: 0;
         *  Set this bit to enable sending short packet with single_send mode.
         */
        uint32_t single_send_en:1;
        /** always_send_num : R/W; bitpos: [6:4]; default: 0;
         *  Configures always_send mode.
         */
        uint32_t always_send_num:3;
        /** always_send_en : R/W; bitpos: [7]; default: 0;
         *  Set this bit to enable sending short packet with always_send mode.
         */
        uint32_t always_send_en:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} uhci_quick_sent_reg_t;

/** Type of reg_q0_word0 register
 *  UHCI Q0_WORD0 Quick Send Register
 */
typedef union {
    struct {
        /** send_q0_word0 : R/W; bitpos: [31:0]; default: 0;
         *  Serves as quick sending register in specified mode in UHCI_ALWAYS_SEND_NUM or
         *  UHCI_SINGLE_SEND_NUM.
         */
        uint32_t send_q0_word0:32;
    };
    uint32_t val;
} uhci_reg_q0_word0_reg_t;

/** Type of reg_q0_word1 register
 *  UHCI Q0_WORD1 Quick Send Register
 */
typedef union {
    struct {
        /** send_q0_word1 : R/W; bitpos: [31:0]; default: 0;
         *  Serves as quick sending register in specified mode in UHCI_ALWAYS_SEND_NUM or
         *  UHCI_SINGLE_SEND_NUM.
         */
        uint32_t send_q0_word1:32;
    };
    uint32_t val;
} uhci_reg_q0_word1_reg_t;

/** Type of reg_q1_word0 register
 *  UHCI Q1_WORD0 Quick Send Register
 */
typedef union {
    struct {
        /** send_q1_word0 : R/W; bitpos: [31:0]; default: 0;
         *  Serves as quick sending register in specified mode in UHCI_ALWAYS_SEND_NUM or
         *  UHCI_SINGLE_SEND_NUM.
         */
        uint32_t send_q1_word0:32;
    };
    uint32_t val;
} uhci_reg_q1_word0_reg_t;

/** Type of reg_q1_word1 register
 *  UHCI Q1_WORD1 Quick Send Register
 */
typedef union {
    struct {
        /** send_q1_word1 : R/W; bitpos: [31:0]; default: 0;
         *  Serves as quick sending register in specified mode in UHCI_ALWAYS_SEND_NUM or
         *  UHCI_SINGLE_SEND_NUM.
         */
        uint32_t send_q1_word1:32;
    };
    uint32_t val;
} uhci_reg_q1_word1_reg_t;

/** Type of reg_q2_word0 register
 *  UHCI Q2_WORD0 Quick Send Register
 */
typedef union {
    struct {
        /** send_q2_word0 : R/W; bitpos: [31:0]; default: 0;
         *  Serves as quick sending register in specified mode in UHCI_ALWAYS_SEND_NUM or
         *  UHCI_SINGLE_SEND_NUM.
         */
        uint32_t send_q2_word0:32;
    };
    uint32_t val;
} uhci_reg_q2_word0_reg_t;

/** Type of reg_q2_word1 register
 *  UHCI Q2_WORD1 Quick Send Register
 */
typedef union {
    struct {
        /** send_q2_word1 : R/W; bitpos: [31:0]; default: 0;
         *  Serves as quick sending register in specified mode in UHCI_ALWAYS_SEND_NUM or
         *  UHCI_SINGLE_SEND_NUM.
         */
        uint32_t send_q2_word1:32;
    };
    uint32_t val;
} uhci_reg_q2_word1_reg_t;

/** Type of reg_q3_word0 register
 *  UHCI Q3_WORD0 Quick Send Register
 */
typedef union {
    struct {
        /** send_q3_word0 : R/W; bitpos: [31:0]; default: 0;
         *  Serves as quick sending register in specified mode in UHCI_ALWAYS_SEND_NUM or
         *  UHCI_SINGLE_SEND_NUM.
         */
        uint32_t send_q3_word0:32;
    };
    uint32_t val;
} uhci_reg_q3_word0_reg_t;

/** Type of reg_q3_word1 register
 *  UHCI Q3_WORD1 Quick Send Register
 */
typedef union {
    struct {
        /** send_q3_word1 : R/W; bitpos: [31:0]; default: 0;
         *  Serves as quick sending register in specified mode in UHCI_ALWAYS_SEND_NUM or
         *  UHCI_SINGLE_SEND_NUM.
         */
        uint32_t send_q3_word1:32;
    };
    uint32_t val;
} uhci_reg_q3_word1_reg_t;

/** Type of reg_q4_word0 register
 *  UHCI Q4_WORD0 Quick Send Register
 */
typedef union {
    struct {
        /** send_q4_word0 : R/W; bitpos: [31:0]; default: 0;
         *  Serves as quick sending register in specified mode in UHCI_ALWAYS_SEND_NUM or
         *  UHCI_SINGLE_SEND_NUM.
         */
        uint32_t send_q4_word0:32;
    };
    uint32_t val;
} uhci_reg_q4_word0_reg_t;

/** Type of reg_q4_word1 register
 *  UHCI Q4_WORD1 Quick Send Register
 */
typedef union {
    struct {
        /** send_q4_word1 : R/W; bitpos: [31:0]; default: 0;
         *  Serves as quick sending register in specified mode in UHCI_ALWAYS_SEND_NUM or
         *  UHCI_SINGLE_SEND_NUM.
         */
        uint32_t send_q4_word1:32;
    };
    uint32_t val;
} uhci_reg_q4_word1_reg_t;

/** Type of reg_q5_word0 register
 *  UHCI Q5_WORD0 Quick Send Register
 */
typedef union {
    struct {
        /** send_q5_word0 : R/W; bitpos: [31:0]; default: 0;
         *  Serves as quick sending register in specified mode in UHCI_ALWAYS_SEND_NUM or
         *  UHCI_SINGLE_SEND_NUM.
         */
        uint32_t send_q5_word0:32;
    };
    uint32_t val;
} uhci_reg_q5_word0_reg_t;

